---
type: AdvancedLossFactor
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 9
tags: [revit-api, class]
---

# AdvancedLossFactor

`Autodesk.Revit.DB.Lighting.AdvancedLossFactor` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AdvancedLossFactor | — | `` |
| Constructor | AdvancedLossFactor | 2013 | `public AdvancedLossFactor ()` |
| Property | BallastLossFactor | 2013 | `public double BallastLossFactor { get ; set ; }` |
| Property | LampLumenDepreciation | 2013 | `public double LampLumenDepreciation { get ; set ; }` |
| Property | LampTiltLossFactor | 2013 | `public double LampTiltLossFactor { get ; set ; }` |
| Property | LuminaireDirtDepreciation | 2013 | `public double LuminaireDirtDepreciation { get ; set ; }` |
| Property | SurfaceDepreciationLossFactor | 2013 | `public double SurfaceDepreciationLossFactor { get ; set ; }` |
| Property | TemperatureLossFactor | 2013 | `public double TemperatureLossFactor { get ; set ; }` |
| Property | VoltageLossFactor | 2013 | `public double VoltageLossFactor { get ; set ; }` |